Revit 2026 API

# VertexStreamPositionColoredAddVertices Method

---
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddVertices(
	IList<VertexPositionColored> vertices
)
```
```vb
Public Sub AddVertices (
	vertices As IList(Of VertexPositionColored)
)
```
```cpp
public:
void AddVertices(
	IList<VertexPositionColored^>^ vertices
)
```
```fsharp
member AddVertices :
        vertices : IList<VertexPositionColored> -> unit
```

#### Parameters

vertices IListVertexPositionColored

#### Reference

VertexStreamPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace